namespace zuoye8_06
{
    internal class Program
    {
        static void Main(string[] args)
        {
            /************************************************************/
            //计算100以内偶数的和

            //int i = 1;
            //int sum = 0;
            //while (i <= 100)
            //{ 
            //    if (i % 2 == 0)
            //    {  
            //        sum =sum + i;
            //    }
            //    i++;
            //}
            //Console.WriteLine(sum);

            /************************************************************/
            //显示出1000-2000年中所有的闰年，并以每行四个数的形式输出

            //方案一
            //int count = 0;
            //for (int i = 1000; i <= 2000; i++)
            //{
            //    if ((i % 4 == 0 && i % 100 != 0) || i % 400 == 0)
            //    {
            //        Console.Write($"{i}\t");
            //        count++;
            //        if (count % 4 == 0)
            //        {
            //            Console.WriteLine();
            //        }
            //    }
            //}

            //方案二
            //int i = 1000;
            //int count = 0;
            //while (i <= 2000)
            //{
            //    if ((i % 4 == 0 && i % 100 != 0) || i % 400 == 0)
            //    {
            //        Console.Write($"{i}\t");
            //        count++;
            //        if (count % 4 == 0)
            //        {
            //            Console.WriteLine();
            //        }
            //    }
            //    i++;
            //}

            /************************************************************/
            //输出一个倒三角形

            //方案一
            //for (int j = 9; j >= 1; j--)
            //{
            //    for (int i = 1; i < j; i++)
            //    {
            //        Console.Write("*");
            //    }
            //    Console.WriteLine();
            //}

            //方案二
            //for (int j = 9; j > 0; j--)
            //{
            //    int i = 1;
            //    while (i < j)
            //    {
            //        Console.Write("*");
            //        i++;
            //    }
            //    Console.WriteLine();
            //}

            /************************************************************/
            //用循环计算下面的结果  1 - 1/2 + 1/3 - 1/4 + ... - 1/100

            //方案一
            //double sum = 0;
            //for (double i = 1; i <= 100; i++)
            //{
            //    if (i % 2 == 0)
            //    {
            //        sum = sum - (1 / i);
            //    }
            //    else if (i % 2 != 0)
            //    {
            //        sum = sum + (1 / i);
            //    }

            //}
            //Console.WriteLine(sum);

            //方案二
            //double i = 1;
            //double sum = 0;
            //while (i <= 100)
            //{
            //    if (i % 2 != 0) sum += 1 / i;
            //    else  sum -= 1 / i;
            //    i++;
            //}
            //Console.WriteLine(sum);

            /************************************************************/
            //求10以内所有数字的阶乘的和
            // 1! = 1 
            // 2! = 1 * 2
            // 3! = 1 * 2 * 3
            // 4! = 1 * 2 * 3 * 4

            //方案一
            int res = 0;
            for (int j = 1; j <= 10; j++)
            {
                int sum = 1;
                for (int i = 1; i <= j; i++)
                {
                    sum = sum * i;
                }
                res += sum;
            }
            Console.WriteLine(res);

            //方案二
            //int sum = 1;
            //int res = 0;
            //for (int i = 1; i <= 10; i++)
            //{
            //    sum = sum * i;
            //    res = res + sum;
            //}
            //Console.WriteLine(res);

            //方案三
            //int sum = 1;
            //int res = 0;
            //int i = 1;
            //while (i <= 10)
            //{
            //    sum = sum * i;
            //    res = res + sum;
            //    i++;
            //}
            //Console.WriteLine(res);

            /************************************************************/
            //篮球从5米高的地方掉下来，每次弹起的高度是原来的30%，
            //经过几次弹起，篮球的高度小于0.1米。
            //  1  5米 ==> 5 * 0.3 = 1.5
            //  2  1.5 ==> 1.5 * 0.3 = 0.45
            //  3  0.45 ==> 0.45 * 0.3 = 0.135
            //  4  0.135 ==> 0.135 * 0.3 = 0.0405

            //double gao = 5;
            //for (int i = 1; i < 100; i++)
            //{
            //    gao = gao * 0.3;
            //    if (gao < 0.1)
            //    {
            //        Console.WriteLine($"经过{i}次弹起，篮球高度低于0.1米");
            //        break;
            //    }
            //}


            /************************************************************/
            //有一个棋盘，有64个方格，在第一个方格里面放1粒芝麻重量是0.00001kg，
            //第二个里面放2粒，第三个里面放4，棋盘上放的所有芝麻的重量
            // 1   1 ==> 1 * 0.00001
            // 2   1*2 ==> 2 * 0.00001 
            // 3   2*2 ==> 4 * 0.00001

            //double sum = 0;
            //double res = 1;
            //for (int i = 1; i <= 64; i++)
            //{
            //    sum = sum + res;
            //    res = res * 2;
            //}
            //double zongzhong = sum * 0.00001;
            //Console.WriteLine($"总数：{sum}");
            //Console.WriteLine($"总重：{zongzhong}");

            /************************************************************/
            //某人在银行有50000元存款。银行每月都要收取服务费，
            //存款大于5000元时每个月收取总额的5%，总额不大于5000元的时候不收服务费；
            //假设这个人存了以后从来都不用，用循环计算银行要扣这个人的手续费能扣多少次？
            //每次扣取后剩余多少钱？

            //double sum = 50000;  
            //for (int i = 1; i < 10000; i++)
            //{
            //    sum = sum - (sum * 0.05);
            //    Console.WriteLine($"第{i}次扣取剩余{sum:F2}");
            //    if (sum < 5000)
            //    {
            //        Console.WriteLine($"第{i}次扣取，剩余{sum:F2}不足5000，不再扣费");
            //        break;
            //    }
            //}


            /************************************************************/
            //猴子摘桃，猴子摘了x个桃，每天吃一半，再多吃一个，
            //第7天吃的时候剩下一个了，猴子摘了多少桃子？
            // 7 剩下1  ==>  (1+1) * 2 = 4 
            // 6 剩下4  ==>  (4+1) * 2 = 10
            // 5 剩下10 ==>  (10+1) * 2 = 22

            //int sum = 1;
            //for (int i = 7; i > 1; i--)
            //{
            //    sum = (sum + 1) * 2;
            //}
            //Console.WriteLine(sum);

            /************************************************************/
            //有个皮球，每次落地弹起都是高度的一半，如果从10米高的地方丢下，
            //第十次弹起时，皮球总过经历了多少距离。
            // 1 ==> 10 + 5*2
            // 2 ==> 10 + 5*2 + 2.5*2 
            // 3 ==> 10 + 5*2 + 2.5*2 + 1.25*2 
            // 4 ==> 10 + 5*2 + 2.5*2 + 1.25*2 + 0.625*2

            //double sum = 10;
            //double res = 10;
            //for (int i = 1; i <= 10; i++)
            //{
            //    sum = sum / 2;
            //    res = res + (sum * 2);
            //}
            //Console.WriteLine(res);

        }
    }
}
